Repository: mikeaude1/Molinar-slayer
Catalog: apps/portal/locale/*/LC_MESSAGES/django.po
Languages: es

source: About Us
es: Acerca de nosotros

source: Founded in 1995, the firm aims to provide quality advice and legal representation to domestic and foreign clients seeking to do business in our country. We offer our services through a team of lawyers committed to meeting our clients' needs. We have therefore strived to build a first-class firm and provide excellent service, with transparency, ethics, trust, and the solidity of 20 years of experience behind us.
es: Fundada en 1995, la firma tiene como objetivo brindar asesoría y representación legal de calidad a clientes nacionales y extranjeros que buscan hacer negocios en nuestro país. Ofrecemos nuestros servicios a través de un equipo de abogados comprometidos con satisfacer las necesidades de nuestros clientes. Por ello, nos hemos esforzado por construir una firma de primera clase y ofrecer un servicio excelente, con transparencia, ética, confianza y la solidez de 20 años de experiencia.

source: Mission
es: Misión

source: To provide quality advice and legal representation to domestic and foreign clients seeking to do business in our country.
es: Brindar asesoría y representación legal de calidad a clientes nacionales y extranjeros que buscan hacer negocios en nuestro país.

source: We strive to meet our clients' needs and build a first-class firm, with transparency, ethics, trust, and the solidity of 20 years of experience.
es: Nos esforzamos por satisfacer las necesidades de nuestros clientes y construir una firma de primera clase, con transparencia, ética, confianza y la solidez de 20 años de experiencia.

source: Vision
es: Visión

source: To be a leading firm in the field of criminal defense, known for our quality service, transparency, ethics, trust, and the solidity of 20 years of experience.
es: Ser una firma líder en el ámbito de la defensa penal, reconocida por nuestra calidad de servicio, transparencia, ética, confianza y la solidez de 20 años de experiencia.

source: We aim to provide our clients with the best possible service, and to build a strong relationship based on trust and transparency.
es: Buscamos ofrecer a nuestros clientes el mejor servicio posible y construir una relación sólida basada en la confianza y la transparencia.

source: Values
es: Valores

source: Quality
es: Calidad

source: Transparency
es: Transparencia

source: Ethics
es: Ética

source: Trust
es: Confianza

source: 20 Years of Experience
es: 20 años de experiencia

source: Jesus Molinar Alcaraz - Criminal Defense Lawyer
es: Jesús Molinar Alcaraz - Abogado Penalista

source: Justice, Diligence, and Results
es: Justicia, Diligencia y Resultados

source: Your trusted advocate in criminal defense. Get the expert legal
es: Su defensor de confianza en derecho penal. Obtenga la asesoría legal experta

source: representation you deserve.
es: que merece.

source: Request a Free Consultation
es: Solicite una consulta gratuita

source: About Jesus Molinar Alcaraz
es: Sobre Jesús Molinar Alcaraz

source: Jesus Molinar Alcaraz is a seasoned criminal defense attorney with
es: Jesús Molinar Alcaraz es un abogado penalista experimentado con

source: a proven track record of success. His expertise covers a wide
es: un historial comprobado de éxito. Su experiencia abarca una amplia

source: range of criminal cases, from misdemeanors to serious felonies.
es: gama de casos penales, desde delitos menores hasta delitos graves.

source: With a commitment to justice and client advocacy, Jesus provides
es: Con compromiso con la justicia y la defensa del cliente, Jesús ofrece

source: personalized and aggressive defense strategies tailored to each
es: estrategias de defensa personalizadas y agresivas adaptadas a cada

source: unique case.
es: caso único.

source: Go to About Us
es: Ir a Acerca de nosotros

source: Practice Areas
es: Áreas de práctica

source: Criminal Defense
es: Defensa penal

source: DUI Defense
es: Defensa por DUI

source: Appeals
es: Apelaciones

source: see more
es: ver más

source: Request a Consultation
es: Solicite una consulta

source: Name
es: Nombre

source: Your name
es: Tu nombre

source: Email
es: Correo electrónico

source: Your email
es: Tu correo electrónico

source: Message
es: Mensaje

source: Tell us about your case
es: Cuéntanos sobre tu caso

source: Send Request
es: Enviar solicitud
